xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
#include "app_srv_nrf52.h"
#include "ble_srv_nrf52.h"
#include "drv_ble_flash.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "cmd_nrf52_srv.h"
#include "dev_apollo2.h"
#include "cmd_gpregret.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_delay.h"
#include "FreeRTOS.h"
#include "timers.h"
#include "peer_manager.h"
#include "drv_apollo2.h"
#include "cmd_apollo2.h"
#include "task_ble_conn.h"
#include "drv_ble_flash.h"
#include "nrf_ble_gatt.h"
#include "ble_db_discovery.h"
#include "app_srv_ancs.h"
#include "watch_config.h"


#define LOG_LEVEL_OFF 							0
#define LOG_LEVEL_ERROR 						1
#define LOG_LEVEL_WARNING 						2
#define LOG_LEVEL_INFO 							3
#define LOG_LEVEL_DEBUG 						4
#define NRF_LOG_MODULE_NAME app_srv_nrf52
#define NRF_LOG_LEVEL       					LOG_LEVEL_DEBUG
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
NRF_LOG_MODULE_REGISTER();


//#define DELAY_MS(X)                 nrf_delay_ms(X)
#define DELAY_MS(X)                 vTaskDelay(X)
//#define DELAY_MS(X)                   do{TickType_t xLastWakeTime;xLastWakeTime = xTaskGetTickCount ();vTaskDelayUntil( &xLastWakeTime, X / ( ( TickType_t ) 1000 / 3 ) );}while(0)



BLE_NRF52_DEF(m_nrf52);

extern ble_config_params_t     *g_ble_config;
extern uint16_t g_conn_handle_peripheral;
extern  nrf_ble_gatt_t m_gatt;


#define RESET_TYPE_JUMP_BOOTLOADER                  1
#define RESET_TYPE_RESET                            2
#define RESET_TYPE_BOND_REQUEST                     3
#define RESET_TYPE_MTU_REQUEST                      4

static uint8_t m_reset_type = 0;
extern uint16_t g_conn_handle_peripheral;
extern uint8_t g_ble_passkey[BLE_GAP_PASSKEY_LEN];
extern ble_gap_addr_t  g_peer_addr;
extern ble_advertising_t       m_advertising;
extern bool g_conn_params_update_from_mobile_app;//This flag will be reset to zero when connect and disconnect
extern nrf_ble_gatt_t m_gatt;
extern _drv_ble_flash_ancs_switch g_ancs_switch;
extern _android_bond g_android_bond_table[ANDROID_BOND_MAX];


typedef struct __attribute__ ((packed)) {

	uint8_t command;
	union __attribute__ ((packed)){
		uint32_t error;
		uint32_t bootloader_version;
	}_param;
	uint32_t application_version;
	uint32_t softdevice_version;
	uint32_t pcb_version;
}_app_srv_nrf52_version_code;


typedef struct __attribute__ ((packed))
{
	uint8_t command;
	union __attribute__ ((packed))
	{ 
		uint32_t val;
		struct __attribute__ ((packed))
		{		
			uint32_t call:1;       
			uint32_t wechat:1;       
			uint32_t qq:1;               
			uint32_t sms:1;        
		}bits;
	}u_ancs_switch;	
}_app_srv_nrf52_ancs_switch;
uint8_t g_android_mac[BLE_GAP_ADDR_LEN + 2];	

#define TIMER_INTERVAL            5000 
#define OSTIMER_WAIT_FOR_QUEUE              2 
static TimerHandle_t m_timer; 

bool g_mtu_update_from_mobile_app = false;

static void timeout_handler(TimerHandle_t xTimer);
static void timer_create(void);
static void timer_start(uint32_t timeout_msec);

static void cmd_nrf52_srv_device_name_read(ble_nrf52_evt_t *evt);	
static void cmd_nrf52_srv_adv_param_read(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_adv_param_update(ble_nrf52_evt_t *evt);	
static void cmd_nrf52_srv_conn_param_read(ble_nrf52_evt_t *evt);	
static void cmd_nrf52_srv_conn_param_update(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_version_code_read(void);
static void cmd_nrf52_srv_mtu_request(void);
//static void cmd_nrf52_srv_jump_bootloader(void);
//static void cmd_nrf52_srv_reset(void);
//static void cmd_nrf52_srv_bond_request(void);
static void cmd_nrf52_srv_bond_delete_request_android(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_bond_delete_all_request_android(void);
static void cmd_nrf52_srv_bond_reqeust_android(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_passkey_request_android(void);
static void cmd_nrf52_srv_passkey_confrim_android(void);
static void cmd_nrf52_srv_ancs_notify_disable(void);								
static void cmd_nrf52_srv_ancs_notify_enable(void);	


static void cmd_nrf52_srv_debond_ios(void);
static void cmd_nrf52_srv_debond_android(void);

static void cmd_nrf52_srv_ancs_switch_read(void);								
static void cmd_nrf52_srv_ancs_switch_write(ble_nrf52_evt_t *evt);

static void cmd_nrf52_srv_find_phone_response(ble_nrf52_evt_t *evt);

static void cmd_nrf52_srv_bond_write_direct(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_find_watch(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_get_watch_default_sport_mode(ble_nrf52_evt_t *evt);

#ifdef WATCH_HAS_HYTERA_FUNC
static void cmd_nrf52_srv_hytera_heartrate_collection_start(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_hytera_heartrate_collection_stop(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_hytera_sport_data_collection_start(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_hytera_sport_data_collection_stop(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_hytera_sport_data_read(ble_nrf52_evt_t *evt);
static void cmd_nrf52_srv_hytera_heartrate_data_read(ble_nrf52_evt_t *evt);

#endif


static void nrf52_evt_handler (ble_nrf52_evt_t *evt)
{
    switch (evt->type)
    {
			
        case BLE_NRF52_EVT_CONNECTED:{
					NRF_LOG_INFO("BLE_NRF52_EVT_CONNECTED");
					g_mtu_update_from_mobile_app = false;
				}break;			
        case BLE_NRF52_EVT_DISCONNECTED:{
					NRF_LOG_INFO("BLE_NRF52_EVT_DISCONNECTED");
					
				}break;				
			
        case BLE_NRF52_EVT_CONFIG_DATA:{
					NRF_LOG_DEBUG("BLE_NRF52_EVT_CONFIG_DATA");
					NRF_LOG_HEXDUMP_INFO(evt->params.data.p_data, 20);
					switch(evt->params.data.p_data[0])
					{
					  case CMD_NRF52_SRV_DEVICE_NAME_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_DEVICE_NAME_READ");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_device_name_read(evt);
						}break;
					  case CMD_NRF52_SRV_DEVICE_NAME_UPDATE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_DEVICE_NAME_UPDATE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							task_ble_conn_handle(TASK_BLE_CONN_DEV_NAME_UPDATE, (uint8_t *)evt, evt->params.data.length);
						}break;					
					  case CMD_NRF52_SRV_ADV_PARAM_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ADV_PARAM_READ");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_adv_param_read(evt);
						}break;
					  case CMD_NRF52_SRV_ADV_PARAM_UPDATE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ADV_PARAM_UPDATE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_adv_param_update(evt);
						}break;						
					  case CMD_NRF52_SRV_CONN_PARAM_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_CONN_PARAM_READ");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_conn_param_read(evt);
						}break;
					  case CMD_NRF52_SRV_CONN_PARAM_UPDATE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_CONN_PARAM_UPDATE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_conn_param_update(evt);
						}break;					
					  case CMD_NRF52_SRV_VERSION_CODE_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_VERSION_CODE_READ");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_version_code_read();
						}break;
					  case CMD_NRF52_SRV_VERSION_CODE_UPDATE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_VERSION_CODE_UPDATE");
							/**
							@Note : This feature is not supported.
							*/
						}break;	
					  case CMD_NRF52_SRV_MTU_REQUEST:{
							NRF_LOG_INFO("CMD_NRF52_SRV_MTU_REQUEST");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_mtu_request();
						}break;	

					  case 0xf4:{
							NRF_LOG_INFO("test 1");
//							while(1);
							//pm_peers_delete();
//							APP_ERROR_HANDLER(1);
						}break;		
	

						
