xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
						default:{
							NRF_LOG_INFO("UNSPPORT COMMAND");
							uint8_t response = 0xFF;
							app_srv_nrf52_config_send((uint8_t *)&response, sizeof(response));
							/**<Unspported command need to response to phone APP>*/
						}break;
					}
				}break;
        case BLE_NRF52_EVT_CONFIG_NOTIFY_ENABLE:{
					NRF_LOG_INFO("BLE_NRF52_EVT_CONFIG_NOTIFY_ENABLE");
					ble_srv_common_char_notify_change(NRF52_SRV_CONFIG_CHAR_NOTIFY, true);
				}break;
        case BLE_NRF52_EVT_CONFIG_NOTIFY_DISABLE:{
					NRF_LOG_INFO("BLE_NRF52_EVT_CONFIG_NOTIFY_DISABLE");
					ble_srv_common_char_notify_change(NRF52_SRV_CONFIG_CHAR_NOTIFY, false);
				}break;				
	     case BLE_NRF52_EVT_CONTROL_DATA:{
					NRF_LOG_DEBUG("BLE_NRF52_EVT_CONTROL_DATA");
					NRF_LOG_INFO("evt->params.data.p_data[0] --> %d",evt->params.data.p_data[0]);

					switch(evt->params.data.p_data[0])
					{
					#if 0
					  case CMD_NRF52_SRV_JUMP_BOOTLOADER:{
							NRF_LOG_INFO("CMD_NRF52_SRV_JUMP_BOOTLOADER");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_jump_bootloader();
						}break;
					  case CMD_NRF52_SRV_RESET:{
							NRF_LOG_INFO("CMD_NRF52_SRV_RESET");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_reset();
						}break;	
					#endif
					  case CMD_NRF52_SRV_BOND_REQUEST:{
							NRF_LOG_INFO("CMD_NRF52_SRV_BOND_REQUEST");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_bond_request();
						}break;
					  case CMD_NRF52_SRV_BOND_DELETE_REQUEST_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_BOND_DELETE_REQUEST");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_bond_delete_request_android(evt);
						}break;				
					  case CMD_NRF52_SRV_BOND_DELETE_ALL_REQUEST_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_BOND_DELETE_ALL_REQUEST");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_bond_delete_all_request_android();
						}break;				
					  case CMD_NRF52_SRV_BOND_REQUEST_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_BOND_REQUEST_ANDROID");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_bond_reqeust_android(evt);
						}break;	
					  case CMD_NRF52_SRV_PASSKEY_REQUEST_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_PASSKEY_REQUEST");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_passkey_request_android();
						}break;	
					  case CMD_NRF52_SRV_PASSKEY_CONFIRM_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_PASSKEY_CONFIRM");		
							if(evt->params.data.p_data[1] != CMD_NRF52_SRV_SUCCUSS)
							{
								NRF_LOG_DEBUG("passkey failed");
								DELAY_MS(1000);
								/**<Do not check return error, because it will cause hang up in softdevice>*/
								sd_ble_gap_disconnect(g_conn_handle_peripheral, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
							}
							else
							{
								cmd_nrf52_srv_passkey_confrim_android();
							}
						}break;						
					  case CMD_NRF52_SRV_DISCONNECT:{
							NRF_LOG_INFO("CMD_NRF52_SRV_DISCONNECT");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);

						}break;
					  case CMD_NRF52_SRV_ANCS_SWITCH_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ANCS_SWITCH_READ");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_ancs_switch_read();
						}break;		
					  case CMD_NRF52_SRV_ANCS_SWITCH_WRITE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ANCS_SWITCH_WRITE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_ancs_switch_write(evt);
						}break;								
					  case CMD_NRF52_SRV_ANCS_NOTIFY_ENABLE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ANCS_NOTIFY_ENABLE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_ancs_notify_enable();
						}break;		
					  case CMD_NRF52_SRV_ANCS_NOTIFY_DISABLE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_ANCS_NOTIFY_DISABLE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_ancs_notify_disable();
						}break;								
					  case CMD_NRF52_SRV_DEBOND_IOS:{
							NRF_LOG_INFO("CMD_NRF52_SRV_DEBOND_IOS");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_debond_ios();
						}break;		
					  case CMD_NRF52_SRV_DEBOND_ANDROID:{
							NRF_LOG_INFO("CMD_NRF52_SRV_DEBOND_ANDROID");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_debond_android();
						}break;								
					  case CMD_NRF52_SRV_FIND_PHONE_RESPONSE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_FIND_PHONE_RESPONSE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_find_phone_response(evt);
						}break;								
					  case CMD_NRF52_SRV_BOND_WRITE_DIRECT:{
							NRF_LOG_INFO("CMD_NRF52_SRV_BOND_WRITE_DIRECT");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_bond_write_direct(evt);
						}break;	
					  case CMD_NRF52_SRV_FIND_WATCH:{
							NRF_LOG_INFO("CMD_NRF52_SRV_FIND_WATCH");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_find_watch(evt);
						}break;	
						case CMD_NRF52_SRV_GET_WATCH_DEFAULT_SPORT_MODE:{
							NRF_LOG_INFO("CMD_NRF52_SRV_GET_WATCH_DEFAULT_SPORT_MODE");
							NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
							cmd_nrf52_srv_get_watch_default_sport_mode(evt);						
						}break;

					#ifdef WATCH_HAS_HYTERA_FUNC
						case CMD_NRF52_SRV_HYTERA_HEARTRATE_COLLECTION_START:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_HEARTRATE_COLLECTION_START");
							cmd_nrf52_srv_hytera_heartrate_collection_start(evt);						
						}break;
						case CMD_NRF52_SRV_HYTERA_HEARTRATE_COLLECTION_STOP:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_HEARTRATE_COLLECTION_STOP");
							cmd_nrf52_srv_hytera_heartrate_collection_stop(evt);						
						}break;
						case CMD_NRF52_SRV_HYTERA_SPORT_DATA_COLLECTION_START:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_SPORT_DATA_COLLECTION_START");
							cmd_nrf52_srv_hytera_sport_data_collection_start(evt);						
						}break;
						case CMD_NRF52_SRV_HYTERA_SPORT_DATA_COLLECTION_STOP:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_SPORT_DATA_COLLECTION_STOP");
							cmd_nrf52_srv_hytera_sport_data_collection_stop(evt);						
						}break;
						case CMD_NRF52_SRV_HYTERA_SPORT_DATA_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_SPORT_DATA_READ");
							cmd_nrf52_srv_hytera_sport_data_read(evt);						
						}break;
						case CMD_NRF52_SRV_HYTERA_HEARTRATE_DATA_READ:{
							NRF_LOG_INFO("CMD_NRF52_SRV_HYTERA_HEARTRATE_DATA_READ");
							cmd_nrf52_srv_hytera_heartrate_data_read(evt);						
						}break;
					#endif
						default:{
							/**<Unspported command need to response to phone APP>*/
							NRF_LOG_INFO("UNSPPORT COMMAND");
							uint8_t response = 0xFF;
							app_srv_nrf52_control_send((uint8_t *)&response, sizeof(response));
						}break;
					}				 
				 
				 
				 
			}break;			
        case BLE_NRF52_EVT_CONTROL_NOTIFY_ENABLE:{
					NRF_LOG_INFO("BLE_NRF52_EVT_CONTROL_NOTIFY_ENABLE");
					ble_srv_common_char_notify_change(NRF52_SRV_CONTROL_CHAR_NOTIFY, true);
			}break;
        case BLE_NRF52_EVT_CONTROL_NOTIFY_DISABLE:{
					NRF_LOG_INFO("BLE_NRF52_EVT_CONTROL_NOTIFY_DISABLE");
					ble_srv_common_char_notify_change(NRF52_SRV_CONTROL_CHAR_NOTIFY, false);
				}break;			
			
				
        case BLE_NRF52_EVT_TX_RDY:{
					//NRF_LOG_DEBUG("BLE_NRF52_EVT_TX_RDY");
				}break;
        case BLE_NRF52_EVT_HVC:{
					NRF_LOG_DEBUG("BLE_NRF52_EVT_HVC");

				}break;
						
				default:
					break;
				
