xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
    }


}




uint32_t app_srv_nrf52_init(void)
{
    ble_nrf52_init_t params;
    uint32_t err_code;

    params.evt_handler = nrf52_evt_handler;
    err_code = ble_nrf52_init(&m_nrf52, &params);
    APP_ERROR_CHECK(err_code);

	
		timer_create();
	
    return NRF_SUCCESS;
}



static void timeout_handler(TimerHandle_t xTimer)
{
	uint32_t err_code;
    UNUSED_PARAMETER(xTimer);
    NRF_LOG_DEBUG("timeout_handler");
//	if (pdPASS != xTimerStop(m_timer, OSTIMER_WAIT_FOR_QUEUE))
//	{
//			APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
//	}	


	
	if(m_reset_type == RESET_TYPE_JUMP_BOOTLOADER)
	{
		err_code = sd_power_gpregret_clr(0, 0xffffffff);
		APP_ERROR_CHECK(err_code);
		err_code = sd_power_gpregret_set(0, CMD_GPREGRET_BOOTLOADER_BLE_DFU);
		APP_ERROR_CHECK(err_code);								
		nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_DFU);	
	}
	else if(m_reset_type == RESET_TYPE_RESET)
	{
		err_code = sd_power_gpregret_clr(0, 0xffffffff);
		APP_ERROR_CHECK(err_code);
		err_code = sd_power_gpregret_set(0, CMD_GPREGRET_BOOTLOADER_BLE_RESET);
		APP_ERROR_CHECK(err_code);								
		nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_RESET);		
	}
	else if(m_reset_type == RESET_TYPE_BOND_REQUEST)
	{
		pm_conn_sec_status_t conn_sec_status;
		err_code = pm_conn_sec_status_get(g_conn_handle_peripheral, &conn_sec_status);
		NRF_LOG_INFO("conn_sec_status.bonded --> %d",conn_sec_status.bonded);
		NRF_LOG_INFO("conn_sec_status.encrypted --> %d",conn_sec_status.encrypted);
		NRF_LOG_INFO("conn_sec_status.connected --> %d",conn_sec_status.connected);
		NRF_LOG_INFO("conn_sec_status.mitm_protected --> %d",conn_sec_status.mitm_protected);
		
		if(conn_sec_status.connected)
		{
		
			if(!conn_sec_status.encrypted || !conn_sec_status.mitm_protected)
//			if(!conn_sec_status.encrypted)
			{
				err_code = pm_conn_secure(g_conn_handle_peripheral,false);
				NRF_LOG_INFO("pm_conn_secure err_code --> 0x%08X",err_code);
				if(err_code == NRF_ERROR_INVALID_STATE)
				{
					NRF_LOG_INFO("pm_conn_secure --> NRF_ERROR_INVALID_STATE");
				}
				else{
					APP_ERROR_CHECK(err_code);	
				}
					
			}
			else
			{
//				uint8_t response[2] = {CMD_NRF52_SRV_BOND_REQUEST_RESPONSE,CMD_NRF52_SRV_SUCCUSS};
//				app_srv_nrf52_control_send(response, sizeof(response));			
				extern ble_db_discovery_t m_db_disc[];
				// Discover peer's services.
				err_code  = ble_db_discovery_start(&m_db_disc[DISCONVER_ARRAY_ANCS], g_conn_handle_peripheral);
				if (err_code != NRF_ERROR_BUSY)
				{
						APP_ERROR_CHECK(err_code);
				}			
			}		
		}

	}if(m_reset_type == RESET_TYPE_MTU_REQUEST)
	{		
		g_mtu_update_from_mobile_app = true;
		uint32_t err_code = sd_ble_gattc_exchange_mtu_request(g_conn_handle_peripheral, 247);
		APP_ERROR_CHECK(err_code);
        #if !defined WATCH_HAS_HYTERA_FUNC && !defined BLE_ALWAYS_DISCONNECT_DEBUG
		ble_gap_data_length_params_t const dlp =
		{
				.max_rx_octets  = 247,
				.max_tx_octets  = 247,
				.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
				.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
		};
		err_code = sd_ble_gap_data_length_update(g_conn_handle_peripheral, &dlp, NULL);		
		APP_ERROR_CHECK(err_code);	
        #endif
	
	}
	

	
}
static void timer_create(void)
{
	m_timer = xTimerCreate("RST",
																 TIMER_INTERVAL,
																 pdFALSE,
																 NULL,
																 timeout_handler);
	if (NULL == m_timer)
	{
			APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
	}	
}
static void timer_start(uint32_t timeout_msec)
{
	if( xTimerChangePeriod( m_timer, timeout_msec , OSTIMER_WAIT_FOR_QUEUE ) == pdPASS )
	{
		NRF_LOG_DEBUG("The command was successfully sent.");
	}
	else
	{
		NRF_LOG_DEBUG("The command could not be sent, even after waiting for 100 ticks");
		NRF_LOG_DEBUG("to pass.  Take appropriate action here.");
	}		
	
}



void app_srv_nrf52_config_send(uint8_t *p_data, uint32_t length)
{
	NRF_LOG_DEBUG("app_srv_nrf52_config_send");
	
	uint32_t bytes_sent = 0;
	uint16_t packet_length = 0;	
	uint32_t err_code;

	while(bytes_sent < length)
	{
		packet_length = (length - bytes_sent) > BLE_NRF52_MAX_DATA_LEN ? BLE_NRF52_MAX_DATA_LEN : length - bytes_sent;
		err_code = ble_srv_nrf52_config_string_send(&m_nrf52, p_data + bytes_sent, &packet_length);	
		
		/**
		 * @retval ::NRF_ERROR_BUSY For @ref BLE_GATT_HVX_INDICATION Procedure already in progress. Wait for a @ref BLE_GATTS_EVT_HVC event and retry.		
		 * @retval ::NRF_ERROR_RESOURCES Too many notifications queued.
		 *                               Wait for a @ref BLE_GATTS_EVT_HVN_TX_COMPLETE event and retry.		
		*/
		if(err_code == NRF_ERROR_BUSY) 
		{
			//Wait for a @ref BLE_GATTS_EVT_HVC event and retry
		}
		else if(err_code == NRF_ERROR_RESOURCES) 
		{
			//Wait for a @ref BLE_GATTS_EVT_HVN_TX_COMPLETE event and retry
		}
		else if(err_code == NRF_SUCCESS) 
		{
			bytes_sent += packet_length;
		}
		else //if ((err_code == NRF_ERROR_INVALID_STATE)||(err_code == NRF_ERROR_INVALID_PARAM))
		{
			/**<Connection handle invalid or Char notification is not enabled>*/
			break;
		}		
		
	}		
	NRF_LOG_DEBUG("app_srv_nrf52_config_send finish");
}



uint32_t app_srv_nrf52_control_send(uint8_t *p_data, uint32_t length)
{
	NRF_LOG_DEBUG("app_srv_nrf52_control_send");
	uint32_t bytes_sent = 0;
	uint16_t packet_length = 0;	
	uint32_t err_code;

	while(bytes_sent < length)
	{
		packet_length = (length - bytes_sent) > BLE_NRF52_MAX_DATA_LEN ? BLE_NRF52_MAX_DATA_LEN : length - bytes_sent;
		err_code = ble_srv_nrf52_control_string_send(&m_nrf52, p_data + bytes_sent, &packet_length);	
		
		/**
		 * @retval ::NRF_ERROR_BUSY For @ref BLE_GATT_HVX_INDICATION Procedure already in progress. Wait for a @ref BLE_GATTS_EVT_HVC event and retry.		
		 * @retval ::NRF_ERROR_RESOURCES Too many notifications queued.
		 *                               Wait for a @ref BLE_GATTS_EVT_HVN_TX_COMPLETE event and retry.		
		*/
		if(err_code == NRF_ERROR_BUSY) 
		{
			//Wait for a @ref BLE_GATTS_EVT_HVC event and retry
		}
		else if(err_code == NRF_ERROR_RESOURCES) 
		{
			//Wait for a @ref BLE_GATTS_EVT_HVN_TX_COMPLETE event and retry
		}
		else if(err_code == NRF_SUCCESS) 
		{
			bytes_sent += packet_length;
		}
		else //if ((err_code == NRF_ERROR_INVALID_STATE)||(err_code == NRF_ERROR_INVALID_PARAM))
		{
			/**<Connection handle invalid or Char notification is not enabled>*/
			break;
		}		
	}		
	NRF_LOG_DEBUG("app_srv_nrf52_control_send finish");
	return err_code;
}


						
static void cmd_nrf52_srv_device_name_read(ble_nrf52_evt_t *evt)
{
	_app_srv_nrf52_dev_name response;
	response.command = CMD_NRF52_SRV_DEVICE_NAME_READ_RESPONSE;
	memcpy(response.param.dev.name,g_ble_config->dev_name.name,g_ble_config->dev_name.len);
	response.param.dev.len = g_ble_config->dev_name.len;
	app_srv_nrf52_config_send((uint8_t *)&response, sizeof(response));
}	

static void cmd_nrf52_srv_adv_param_read(ble_nrf52_evt_t *evt)
{
	_app_srv_nrf52_adv_param response;
	response.command = CMD_NRF52_SRV_ADV_PARAM_READ_RESPONSE;
	memcpy((uint8_t *)&response.param.adv,(uint8_t *)&g_ble_config->adv_params,sizeof(ble_config_adv_params_t));	
	app_srv_nrf52_config_send((uint8_t *)&response, sizeof(response));	
}	
static void cmd_nrf52_srv_adv_param_update(ble_nrf52_evt_t *evt)
{
	_app_srv_nrf52_adv_param response;
	_app_srv_nrf52_adv_param *new_adv_param = (_app_srv_nrf52_adv_param *)evt->params.data.p_data;
	response.command = CMD_NRF52_SRV_ADV_PARAM_UPDATE_RESPONSE;
	if(new_adv_param->param.adv.enable_fast > 1 || new_adv_param->param.adv.enable_slow > 1 ||
			new_adv_param->param.adv.interval_fast < 0x0020 || new_adv_param->param.adv.interval_slow > 0x4000 )
	{
			response.param.error = CMD_NRF52_SRV_ERROR_OUT_OF_BOUND;
	}
	else if(new_adv_param->param.adv.interval_fast > new_adv_param->param.adv.interval_slow)
	{
			response.param.error = CMD_NRF52_SRV_ERROR_INVALID_PARAMS;
	}
	else{	
			memcpy((uint8_t *)&g_ble_config->adv_params,(uint8_t *)&new_adv_param->param.adv,sizeof(ble_config_adv_params_t));
			
			//Settings will take effect after disconnection.
			m_advertising.adv_modes_config.ble_adv_fast_enabled = new_adv_param->param.adv.enable_fast;
			m_advertising.adv_modes_config.ble_adv_fast_interval = new_adv_param->param.adv.interval_fast;
			m_advertising.adv_modes_config.ble_adv_fast_timeout = new_adv_param->param.adv.timeout_fast;
			m_advertising.adv_modes_config.ble_adv_slow_enabled = new_adv_param->param.adv.enable_slow;
			m_advertising.adv_modes_config.ble_adv_slow_interval = new_adv_param->param.adv.interval_slow;
			m_advertising.adv_modes_config.ble_adv_slow_timeout = new_adv_param->param.adv.timeout_slow;		
			response.param.error = CMD_NRF52_SRV_SUCCUSS;
	}
	app_srv_nrf52_config_send((uint8_t *)&response, 2);
}	

static void cmd_nrf52_srv_conn_param_read(ble_nrf52_evt_t *evt)
{
	_app_srv_nrf52_conn_param response;
	response.command = CMD_NRF52_SRV_CONN_PARAM_READ_RESPONSE;
	memcpy((uint8_t*)&response.param.conn_param, &g_ble_config->conn_params,sizeof(ble_config_conn_params_t));
	app_srv_nrf52_config_send((uint8_t *)&response, sizeof(response));
}	

