xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
static void cmd_nrf52_srv_conn_param_update(ble_nrf52_evt_t *evt)
{
	_app_srv_nrf52_conn_param response;
	uint16_t err_code;
	_app_srv_nrf52_conn_param *conn_param = (_app_srv_nrf52_conn_param *)evt->params.data.p_data;
	

	response.command = CMD_NRF52_SRV_CONN_PARAM_UPDATE_RESPONSE;
	
	uint16_t watch_min_interval = g_ble_config->conn_params.min_conn_int;
	uint16_t watch_max_interval = g_ble_config->conn_params.max_conn_int;
	uint16_t app_min_interval = conn_param->param.conn_param.min_conn_int;
	uint16_t app_max_interval = conn_param->param.conn_param.max_conn_int;
	
	NRF_LOG_DEBUG("watch_min_interval --> %d",watch_min_interval);
	NRF_LOG_DEBUG("watch_max_interval --> %d",watch_max_interval);
	NRF_LOG_DEBUG("app_min_interval --> %d",app_min_interval);
	NRF_LOG_DEBUG("app_max_interval --> %d",app_max_interval);
	
	
	
	
	
	
	if((app_min_interval>(watch_min_interval/2)) && 
		 (app_min_interval<(watch_min_interval*2)) && 
		 (app_max_interval>(watch_max_interval/2)) && 
		 (app_max_interval<(watch_max_interval*2))
	  )
	{
				_app_srv_nrf52_conn_param response;
				response.command = CMD_NRF52_SRV_CONN_PARAM_UPDATE_RESPONSE;
				response.param.error = CMD_NRF52_SRV_SUCCUSS;
				app_srv_nrf52_config_send((uint8_t *)&response, 2);			
	}
	else{
//		if(evt->params.data.length != (sizeof(response.command)+sizeof(response.param.conn_param)))
//		{
//			response.param.error = CMD_NRF52_SRV_ERROR_INVALID_PARAMS;
//		}
//		else if (conn_param->param.conn_param.max_conn_int <= conn_param->param.conn_param.min_conn_int ||
//				conn_param->param.conn_param.slave_latency > 4 ||
//				conn_param->param.conn_param.sup_timeout > 400)
//		{
//			NRF_LOG_DEBUG("CMD_NRF52_SRV_ERROR_INVALID_PARAMS");
//			response.param.error = CMD_NRF52_SRV_ERROR_CONN_PARAM_NOT_ACCEPT;
//		}
//		else
		{
			ble_gap_conn_params_t p_new_params;
			p_new_params.max_conn_interval = conn_param->param.conn_param.max_conn_int;
			p_new_params.min_conn_interval = conn_param->param.conn_param.min_conn_int;
			p_new_params.slave_latency = conn_param->param.conn_param.slave_latency;
			p_new_params.conn_sup_timeout = conn_param->param.conn_param.sup_timeout;

			err_code = ble_conn_params_stop();
			APP_ERROR_CHECK(err_code);
			err_code = ble_conn_params_change_conn_params(g_conn_handle_peripheral, &p_new_params);
			
			if(err_code != NRF_SUCCESS)
			{
				NRF_LOG_ERROR("ble_conn_params_change_conn_params err_code --> 0x%08X",err_code);
				response.param.error = err_code | CMD_NRF52_SRV_ERROR_INTERVAL_MASK;
			}
			else{
				response.param.error = CMD_NRF52_SRV_SUCCUSS;
				g_conn_params_update_from_mobile_app = true;//Wait for on_conn_params_evt is called
			}		
		
		}
		if(response.param.error != CMD_NRF52_SRV_SUCCUSS)
		{
			app_srv_nrf52_config_send((uint8_t *)&response, 2);
		}	
		
	}
	
	

	
}
static void cmd_nrf52_srv_version_code_read(void)						
{
	_dev_apollo2_ble_info ble_info;
	dev_apollo2_ble_info_get(&ble_info);			
	_app_srv_nrf52_version_code version_code = 
	{
		 .command = CMD_NRF52_SRV_VERSION_CODE_READ_RESPONSE,
		 ._param = {ble_info.bootloader_version},
		 .application_version = ble_info.application_version,
		 .softdevice_version = ble_info.softdevice_version,
		 .pcb_version = ble_info.pcb_version,	
	};
	app_srv_nrf52_config_send((uint8_t *)&version_code, sizeof(version_code));
}			

static void cmd_nrf52_srv_mtu_request(void)
{
//	uint8_t response[3] = {CMD_NRF52_SRV_MTU_REQUEST_RESPONSE};
//	uint16_t mtu = nrf_ble_gatt_eff_mtu_get(&m_gatt, g_conn_handle_peripheral) - 3;
//	response[1] = mtu>>8;
//	response[2] = mtu;
//	app_srv_nrf52_config_send((uint8_t *)response, sizeof(response));
	
	if(g_mtu_update_from_mobile_app == false)
	{
		m_reset_type = RESET_TYPE_MTU_REQUEST;							
		timer_start(1000);	
	}else{
	
		uint8_t response[3] = {CMD_NRF52_SRV_MTU_REQUEST_RESPONSE};
		uint16_t mtu = nrf_ble_gatt_eff_mtu_get(&m_gatt, g_conn_handle_peripheral) - 3;
		response[1] = mtu>>8;
		response[2] = mtu;
		app_srv_nrf52_config_send((uint8_t *)response, sizeof(response));		
	
	}
	
	
	
	
}	
#if 0
static void cmd_nrf52_srv_jump_bootloader(void)
{
	uint8_t response = CMD_NRF52_SRV_JUMP_BOOTLOADER_RESPONSE;
	app_srv_nrf52_control_send(&response, sizeof(response));
	m_reset_type = RESET_TYPE_JUMP_BOOTLOADER;							
	timer_start(5000);
}	

static void cmd_nrf52_srv_reset(void)
{
	uint8_t response = CMD_NRF52_SRV_RESET_RESPONSE;
	app_srv_nrf52_control_send(&response, sizeof(response));
	m_reset_type = RESET_TYPE_RESET;
	timer_start(5000);
}	
#endif
void cmd_nrf52_srv_bond_request(void)
{
	m_reset_type = RESET_TYPE_BOND_REQUEST;
	timer_start(3000);
}	

static void cmd_nrf52_srv_bond_delete_request_android(ble_nrf52_evt_t *evt)
{
	_bond_request_android *bond_request_android = (_bond_request_android *)evt->params.data.p_data;
	NRF_LOG_HEXDUMP_DEBUG(bond_request_android->mac,BLE_GAP_ADDR_LEN);	
//	memcpy(g_android_mac,bond_request_android->mac,BLE_GAP_ADDR_LEN);	
	uint32_t error;
//	uint8_t i=0;
//	for(i=0;i<ANDROID_BOND_MAX;i++)
//	{
//		if(!memcmp(g_android_bond_table[i].mac,g_android_mac,BLE_GAP_ADDR_LEN))
//		{
//			break;
//		}			
//	}		
//	NRF_LOG_DEBUG("mac address index --> %d",i);
	
	uint8_t i=0;
	for(i=0;i<ANDROID_BOND_MAX;i++)
	{
		memset(g_android_bond_table[i].mac,0xFF,BLE_GAP_ADDR_LEN);	
	}		
	memset(g_android_mac,0xFF,sizeof(g_android_mac));	
	error = drv_ble_flash_android_mac_delete_all();
	APP_ERROR_CHECK(error);	
	
	
	uint8_t response[2] = {CMD_NRF52_SRV_BOND_DELETE_REQUEST_ANDROID_RESPONSE,CMD_NRF52_SRV_SUCCUSS};
	app_srv_nrf52_control_send(response, sizeof(response));	
}	

static void cmd_nrf52_srv_bond_delete_all_request_android(void)
{
	uint32_t error;
	uint8_t i=0;
	for(i=0;i<ANDROID_BOND_MAX;i++)
	{
		memset(g_android_bond_table[i].mac,0xFF,BLE_GAP_ADDR_LEN);	
	}		
	memset(g_android_mac,0xFF,sizeof(g_android_mac));		
	error = drv_ble_flash_android_mac_delete_all();
	APP_ERROR_CHECK(error);
	uint8_t response[2] = {CMD_NRF52_SRV_BOND_DELETE_ALL_REQUEST_ANDROID_RESPONSE,CMD_NRF52_SRV_SUCCUSS};
	app_srv_nrf52_control_send(response, sizeof(response));	
}	



static void cmd_nrf52_srv_bond_reqeust_android(ble_nrf52_evt_t *evt)
{
	_bond_request_android *bond_request_android = (_bond_request_android *)evt->params.data.p_data;
	NRF_LOG_HEXDUMP_DEBUG(bond_request_android->mac,BLE_GAP_ADDR_LEN);	
	memcpy(g_android_mac,bond_request_android->mac,BLE_GAP_ADDR_LEN);
	uint8_t response[2] = {CMD_NRF52_SRV_BOND_REQUEST_ANDROID_RESPONSE,CMD_NRF52_SRV_ERROR_ANDROID_MAC_NOT_EXIT};
	uint8_t empty_space[BLE_GAP_ADDR_LEN] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
	uint8_t i=0;
	for(i=0;i<ANDROID_BOND_MAX;i++)
	{
		NRF_LOG_HEXDUMP_INFO(g_android_bond_table[i].mac,BLE_GAP_ADDR_LEN);	
		if(!memcmp(g_android_bond_table[i].mac,empty_space,BLE_GAP_ADDR_LEN))
		{
			break;
		}
	}	
	
