xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
	if(i == ANDROID_BOND_MAX)
	{
		response[1] = CMD_NRF52_SRV_ERROR_ANDROID_MAC_TABLE_FULL;
	}
	else
	{
		for(i=0;i<ANDROID_BOND_MAX;i++)
		{
			if(!memcmp(g_android_bond_table[i].mac,g_android_mac,BLE_GAP_ADDR_LEN))
			{
				response[1] = CMD_NRF52_SRV_SUCCUSS;
				break;
			}			
		}	
	}


	app_srv_nrf52_control_send(response, sizeof(response));	
	
//	if(response[1] == CMD_NRF52_SRV_SUCCUSS)
//	{
//		task_ble_conn_handle(TASK_BLE_CONN_EVT_BOND_ANDROID, NULL, 0);
//	}
	
	
}	


static void cmd_nrf52_srv_bond_write_direct(ble_nrf52_evt_t *evt)
{
	_bond_request_android *bond_request_android = (_bond_request_android *)evt->params.data.p_data;
	memcpy(g_android_mac,bond_request_android->mac,BLE_GAP_ADDR_LEN);
	uint32_t error = NRF_SUCCESS;
	error = drv_ble_flash_android_mac_write(0, g_android_mac);
//	APP_ERROR_CHECK(error);	
	uint8_t response[2] = {CMD_NRF52_SRV_BOND_WRITE_DIRECT_RESPONSE,0};
	response[1] = error;
	memcpy(g_android_bond_table[0].mac,g_android_mac,BLE_GAP_ADDR_LEN);
	app_srv_nrf52_control_send(response, sizeof(response));		
}


static void cmd_nrf52_srv_passkey_request_android(void)							
{
	/**<Only android APP will send this request>*/
	/**<Calculate a 6 digits random number and send that to APOLLO2 and back to android>*/
	uint32_t error = NRF_SUCCESS;
	uint8_t p_pool_capacity,p_bytes_available;
	uint8_t p_buff[6];
	error = sd_rand_application_pool_capacity_get(&p_pool_capacity);
	APP_ERROR_CHECK(error);
	NRF_LOG_DEBUG("p_pool_capacity --> %d",p_pool_capacity);
	error = sd_rand_application_bytes_available_get(&p_bytes_available);
	APP_ERROR_CHECK(error);
	NRF_LOG_DEBUG("p_bytes_available --> %d",p_bytes_available);
	error = sd_rand_application_vector_get(p_buff, sizeof(p_buff));
	APP_ERROR_CHECK(error);
	NRF_LOG_HEXDUMP_INFO(p_buff, sizeof(p_buff));
	for(uint8_t i=0;i<sizeof(p_buff);i++)
	{
		p_buff[i] |= '0';
		p_buff[i] &= '9';
	}
	NRF_LOG_HEXDUMP_INFO(p_buff, sizeof(p_buff));
	memcpy(g_ble_passkey,p_buff,BLE_GAP_PASSKEY_LEN);
	uint8_t response[7] = {CMD_NRF52_SRV_PASSKEY_REQUEST_ANDROID_RESPONSE};
	memcpy(response+1,p_buff,BLE_GAP_PASSKEY_LEN);
	app_srv_nrf52_control_send(response, sizeof(response));							
	task_ble_conn_handle(TASK_BLE_CONN_EVT_PASSKEY, g_ble_passkey, BLE_GAP_PASSKEY_LEN);
}

static void cmd_nrf52_srv_passkey_confrim_android(void)							
{
	uint32_t error = NRF_SUCCESS;
	uint8_t empty_space[BLE_GAP_ADDR_LEN] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
	uint8_t i=0;
	for(i=0;i<ANDROID_BOND_MAX;i++)
	{
		if(!memcmp(g_android_bond_table[i].mac,empty_space,BLE_GAP_ADDR_LEN))
		{
			break;
		}
	}
	NRF_LOG_DEBUG("bond table index --> %d",i);
	error = drv_ble_flash_android_mac_write(i, g_android_mac);
//	APP_ERROR_CHECK(error);	
	uint8_t response[2] = {CMD_NRF52_SRV_PASSKEY_CONFIRM_ANDROID_RESPONSE,0};
	response[1] = error;
	memcpy(g_android_bond_table[i].mac,g_android_mac,BLE_GAP_ADDR_LEN);
	app_srv_nrf52_control_send(response, sizeof(response));									
	/**<Inform apollo2 that ble is bond>*/
//	task_ble_conn_handle(TASK_BLE_CONN_EVT_BOND_ANDROID, NULL, 0);
}


static void cmd_nrf52_srv_ancs_notify_enable(void)
{
	app_srv_ancs_notify_enable();
}	
static void cmd_nrf52_srv_ancs_notify_disable(void)
{
	app_srv_ancs_notify_disable();
}

static void cmd_nrf52_srv_debond_ios(void)	
{


}
static void cmd_nrf52_srv_debond_android(void)	
{

}	


static void cmd_nrf52_srv_ancs_switch_read(void)
{
#ifndef COD 
	_app_srv_nrf52_ancs_switch app_srv_nrf52_ancs_switch;
	app_srv_nrf52_ancs_switch.command = CMD_NRF52_SRV_ANCS_SWITCH_READ_RESPONSE;
	app_srv_nrf52_ancs_switch.u_ancs_switch.val = 0x00000000;	
	if(g_ancs_switch.call == ANCS_MESSAGE_SWITCH_ON)
	{
		app_srv_nrf52_ancs_switch.u_ancs_switch.bits.call = 1;
	}
	if(g_ancs_switch.wechat == ANCS_MESSAGE_SWITCH_ON)
	{
		app_srv_nrf52_ancs_switch.u_ancs_switch.bits.wechat = 1;
	}
	if(g_ancs_switch.qq == ANCS_MESSAGE_SWITCH_ON)
	{
		app_srv_nrf52_ancs_switch.u_ancs_switch.bits.qq = 1;
	}
	if(g_ancs_switch.sms == ANCS_MESSAGE_SWITCH_ON)
	{
		app_srv_nrf52_ancs_switch.u_ancs_switch.bits.sms = 1;
	}		
	app_srv_nrf52_control_send((uint8_t *)&app_srv_nrf52_ancs_switch, sizeof(app_srv_nrf52_ancs_switch));
#endif
	
}
static void cmd_nrf52_srv_ancs_switch_write(ble_nrf52_evt_t *evt)
{
#ifndef COD 
	_app_srv_nrf52_ancs_switch *app_srv_nrf52_ancs_switch = (_app_srv_nrf52_ancs_switch *)evt->params.data.p_data;
	uint32_t error = NRF_SUCCESS;
	if(app_srv_nrf52_ancs_switch->u_ancs_switch.bits.call)
	{
		g_ancs_switch.call = ANCS_MESSAGE_SWITCH_ON;
	}
	else
	{
		g_ancs_switch.call = ANCS_MESSAGE_SWITCH_OFF;
	}
	if(app_srv_nrf52_ancs_switch->u_ancs_switch.bits.wechat)
	{
		g_ancs_switch.wechat = ANCS_MESSAGE_SWITCH_ON;
	}
	else
	{
		g_ancs_switch.wechat = ANCS_MESSAGE_SWITCH_OFF;
	}	
	if(app_srv_nrf52_ancs_switch->u_ancs_switch.bits.qq)
	{
		g_ancs_switch.qq = ANCS_MESSAGE_SWITCH_ON;
	}
	else
	{
		g_ancs_switch.qq = ANCS_MESSAGE_SWITCH_OFF;
	}		
	if(app_srv_nrf52_ancs_switch->u_ancs_switch.bits.sms)
	{
		g_ancs_switch.sms = ANCS_MESSAGE_SWITCH_ON;
	}
	else
	{
		g_ancs_switch.sms = ANCS_MESSAGE_SWITCH_OFF;
	}			
	
	error = drv_ble_flash_ancs_switch_write(&g_ancs_switch);
	APP_ERROR_CHECK(error);	
	
	uint8_t response[2] = {CMD_NRF52_SRV_ANCS_SWITCH_WRITE_RESPONSE,CMD_NRF52_SRV_SUCCUSS};
	app_srv_nrf52_control_send((uint8_t *)response, sizeof(response));
#endif
}	


static void cmd_nrf52_srv_find_phone_response(ble_nrf52_evt_t *evt)
{
	uint32_t command[5] = {BLE_UART_RESPONSE_APPLICATION_FIND_PHONE | BLE_UART_CCOMMAND_MASK_APPLICATION};
	memcpy((uint8_t *)(command+1),evt->params.data.p_data+1,20);	
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_find_watch(ble_nrf52_evt_t *evt)
{
	uint32_t command[5] = {BLE_UART_CCOMMAND_APPLICATION_FIND_WATCH | BLE_UART_CCOMMAND_MASK_APPLICATION};
	memcpy((uint8_t *)(command+1),evt->params.data.p_data+1,20);	
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_get_watch_default_sport_mode(ble_nrf52_evt_t *evt)
{
    uint32_t command[5] = {BLE_UART_CCOMMAND_APPLICATION_GET_WATCH_DEFAULT_SPORT_MODE | BLE_UART_CCOMMAND_MASK_APPLICATION};
	memcpy((uint8_t *)(command+1),evt->params.data.p_data+1,20);	
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

