xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Service/Nrf52/app_srv_nrf52.c
#ifdef WATCH_HAS_HYTERA_FUNC
static void cmd_nrf52_srv_hytera_heartrate_collection_start(ble_nrf52_evt_t *evt)
{
	uint32_t command[3] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_HEARTRATE_COLLECTION_START | BLE_UART_CCOMMAND_MASK_APPLICATION};
	memcpy((uint8_t *)(command+1),evt->params.data.p_data+1,8);
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_hytera_heartrate_collection_stop(ble_nrf52_evt_t *evt)
{
	uint32_t command[1] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_HEARTRATE_COLLECTION_STOP | BLE_UART_CCOMMAND_MASK_APPLICATION};
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_hytera_sport_data_collection_start(ble_nrf52_evt_t *evt)
{
	uint32_t command[1] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_START | BLE_UART_CCOMMAND_MASK_APPLICATION};
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_hytera_sport_data_collection_stop(ble_nrf52_evt_t *evt)
{
	uint32_t command[1] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_STOP | BLE_UART_CCOMMAND_MASK_APPLICATION};
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_hytera_sport_data_read(ble_nrf52_evt_t *evt)
{
	uint32_t command[1] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_READ | BLE_UART_CCOMMAND_MASK_APPLICATION};
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}

static void cmd_nrf52_srv_hytera_heartrate_data_read(ble_nrf52_evt_t *evt)
{
	uint32_t command[1] = {BLE_UART_CCOMMAND_APPLICATION_HYTERA_HEARTRATE_DATA_READ | BLE_UART_CCOMMAND_MASK_APPLICATION};
	task_ble_conn_handle(TASK_BLE_CONN_EVT_BLE_UART, (uint8_t *)(&command), sizeof(command));
}


#endif



